Revit 2027 API
RebarShapeDefinition.IsPlanar Property
 Reports whether the shape definition lies within a plane: false if a spiral, true in all other cases.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsPlanar { get; }
Public ReadOnly Property IsPlanar As Boolean
	Get
public:
property bool IsPlanar {
	bool get ();
}
member IsPlanar : bool with get
Property Value
Boolean
See Also
Reference
RebarShapeDefinition Class
Autodesk.Revit.DB.Structure Namespace